Revit 2027 API
MetallicPaint.MetallicpaintPearl Property
 The property labeled "Pearl" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetallicpaintPearl { get; }
Public Shared ReadOnly Property MetallicpaintPearl As String
	Get
public:
static property String^ MetallicpaintPearl {
	String^ get ();
}
static member MetallicpaintPearl : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintPearlType".
See Also
Reference
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace